Samples/CreateAccrualActivityRequest.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:type="http://www.ibsplc.com/iloyal/accrual/activity/v2.7/type/">
   <soapenv:Header>
      <wsse:Security soapenv:mustUnderstand="1" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"> 
         <wsu:Timestamp wsu:Id="Timestamp-20046406" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"> 
            <wsu:Created>2020-01-11T10:33:52.303Z</wsu:Created>
            <wsu:Expires>2020-01-11T10:33:52.303Z</wsu:Expires>
         </wsu:Timestamp>
         <wsse:UsernameToken wsu:Id="UsernameToken-20914066" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"> 
            <wsse:Username>mtn</wsse:Username>
            <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordDigest">JC9UDunh4V5pRSEofoUgTur9u5g=</wsse:Password>
            <wsse:Nonce>5lXRolFB0oWSOjRgioe4DA==</wsse:Nonce>
            <wsu:Created>2020-01-11T10:33:52.303Z</wsu:Created>
         </wsse:UsernameToken>
      </wsse:Security>
   </soapenv:Header>
	<soapenv:Body>
		<type:CreateAccrualActivityRequestData>
			<accrualActivities>
				<companyCode>SA</companyCode>
				<membershipNumber>32757624</membershipNumber>
				<givenName>AAA</givenName>
				<familyName>BBB</familyName>
				<businessType>N</businessType>
				<activityDate>26-Jul-2014</activityDate>
				<negativeAccrual>0</negativeAccrual>
				<nonAirAccrualActivityDetails>
					<partnerCategory>L</partnerCategory>
					<partnerCode>MTS</partnerCode>
					<billNumber></billNumber>
					<pointValue>700</pointValue>
					<amountSpent>87.78</amountSpent>				
				</nonAirAccrualActivityDetails>
				 <accrualActivityPartnerAttributes>
               				<attributeKey>PNT</attributeKey>
               				<attributeValue>100</attributeValue>
            			</accrualActivityPartnerAttributes>
				<accrualActivityPartnerAttributes>
               				<attributeKey>BNSPNT</attributeKey>
               				<attributeValue>100</attributeValue>
            			</accrualActivityPartnerAttributes>
			</accrualActivities>
			<txnHeader>
				<transactionID>E499A277B7538E2F07CB809758E98D97</transactionID>
				<userName>mtn</userName>
				<timeStamp>2020-01-11T10:33:52.303Z</timeStamp>
			</txnHeader>
		</type:CreateAccrualActivityRequestData>
	</soapenv:Body>
</soapenv:Envelope>